package com.b430.commonmodule.constant;

import java.util.Arrays;
import java.util.List;

/**
 * 通用常量
 */
public interface CommonConstant {

    /**
     * 升序
     */
    String SORT_ORDER_ASC = "ascend";

    /**
     * 降序
     */
    String SORT_ORDER_DESC = " descend";

    /**
     * SO2 标准值
     */
    Integer SO2_STANDARD = 60;

    /**
     * CO 标准值
     */
    Integer CO_STANDARD = 4;

    /**
     * O3 标准值
     */
    Integer O3_STANDARD = 160;

    /**
     * PM2.5 标准值
     */
    Integer PM25_STANDARD = 75;

    List<String> PROVINCIAL_CAPITALS = Arrays.asList(
            "110101", // 北京
            "310101", // 上海
            "120101", // 天津
            "500101", // 重庆
            "230100", // 哈尔滨
            "220100", // 长春
            "210100", // 沈阳
            "150100", // 呼和浩特
            "130100", // 石家庄
            "140100", // 太原
            "610100", // 西安
            "370100", // 济南
            "650100", // 乌鲁木齐
            "540100", // 拉萨
            "630100", // 西宁
            "620100", // 兰州
            "640100", // 银川
            "410100", // 郑州
            "320100", // 南京
            "420100", // 武汉
            "330100", // 杭州
            "340100", // 合肥
            "350100", // 福州
            "360100", // 南昌
            "430100", // 长沙
            "520100", // 贵阳
            "510100", // 成都
            "440100", // 广州
            "530100", // 昆明
            "450100", // 南宁
            "460100", // 海口
            "710001"  // 台北
    );


    List<String> MAJOR_CITIES = Arrays.asList(
            "110101", // 北京
            "310101", // 上海
            "440300", // 深圳
            "500101", // 重庆
            "440100", // 广州
            "510100", // 成都
            "120101", // 天津
            "420100", // 武汉
            "330100", // 杭州
            "441900", // 东莞
            "610100", // 西安
            "410100", // 郑州
            "320100", // 南京
            "370100", // 济南
            "340100", // 合肥
            "210100", // 沈阳
            "370200", // 青岛
            "430100", // 长沙
            "230100"  // 哈尔滨
    );


}
